microdron-itesm/MicroDronITESM/MicroDron/firmware/src/system_config/default/framework/peripheral/eth/processor/eth_p32mz2048ecm100.h
PLIB_INLINE_API void PLIB_ETH_EventsEnableClr(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     ETH_EventsEnableClr_Default(index, eEvents);
}

PLIB_INLINE_API void PLIB_ETH_EventsEnableWrite(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     ETH_EventsEnableWrite_Default(index, eEvents);
}

PLIB_INLINE_API PLIB_ETH_EVENTS PLIB_ETH_EventsEnableGet(ETH_MODULE_ID index)
{
     return ETH_EventsEnableGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_EventsClr(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     ETH_EventsClr_Default(index, eEvents);
}

PLIB_INLINE_API PLIB_ETH_EVENTS PLIB_ETH_EventsGet(ETH_MODULE_ID index)
{
     return ETH_EventsGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsInterrupt(ETH_MODULE_ID index)
{
     return ETH_ExistsInterrupt_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_ETH_RxPacketCountGet(ETH_MODULE_ID index)
{
     return ETH_RxPacketCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_EthernetIsBusy(ETH_MODULE_ID index)
{
     return ETH_EthernetIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_TransmitIsBusy(ETH_MODULE_ID index)
{
     return ETH_TransmitIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ReceiveIsBusy(ETH_MODULE_ID index)
{
     return ETH_ReceiveIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsEthernetControllerStatus(ETH_MODULE_ID index)
{
     return ETH_ExistsEthernetControllerStatus_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxOverflowCountClear(ETH_MODULE_ID index)
{
     ETH_RxOverflowCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_RxOverflowCountGet(ETH_MODULE_ID index)
{
     return ETH_RxOverflowCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveOverflowCount(ETH_MODULE_ID index)
{
     return ETH_ExistsReceiveOverflowCount_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_FramesTxdOkCountClear(ETH_MODULE_ID index)
{
     ETH_FramesTxdOkCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_FramesTxdOkCountGet(ETH_MODULE_ID index)
{
     return ETH_FramesTxdOkCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFramesTransmittedOK(ETH_MODULE_ID index)
{
     return ETH_ExistsFramesTransmittedOK_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_SingleCollisionCountClear(ETH_MODULE_ID index)
{
     ETH_SingleCollisionCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_SingleCollisionCountGet(ETH_MODULE_ID index)
{
     return ETH_SingleCollisionCountGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MultipleCollisionCountClear(ETH_MODULE_ID index)
{
     ETH_MultipleCollisionCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_MultipleCollisionCountGet(ETH_MODULE_ID index)
{
     return ETH_MultipleCollisionCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsCollisionCounts(ETH_MODULE_ID index)
{
     return ETH_ExistsCollisionCounts_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_FramesRxdOkCountClear(ETH_MODULE_ID index)
{
     ETH_FramesRxdOkCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_FramesRxdOkCountGet(ETH_MODULE_ID index)
{
     return ETH_FramesRxdOkCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFramexReceivedOK(ETH_MODULE_ID index)
{
     return ETH_ExistsFramexReceivedOK_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_FCSErrorCountClear(ETH_MODULE_ID index)
{
     ETH_FCSErrorCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_FCSErrorCountGet(ETH_MODULE_ID index)
{
     return ETH_FCSErrorCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFCSErrorCount(ETH_MODULE_ID index)
{
     return ETH_ExistsFCSErrorCount_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_AlignErrorCountClear(ETH_MODULE_ID index)
{
     ETH_AlignErrorCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_AlignErrorCountGet(ETH_MODULE_ID index)
{
     return ETH_AlignErrorCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsAlignmentErrorCount(ETH_MODULE_ID index)
{
     return ETH_ExistsAlignmentErrorCount_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIResetEnable(ETH_MODULE_ID index)
{
     ETH_MIIResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIResetDisable(ETH_MODULE_ID index)
{
     ETH_MIIResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MIIResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MIIResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_SimResetEnable(ETH_MODULE_ID index)
{
     ETH_SimResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_SimResetDisable(ETH_MODULE_ID index)
{
     ETH_SimResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_SimResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_SimResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MCSRxResetEnable(ETH_MODULE_ID index)
{
     ETH_MCSRxResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MCSRxResetDisable(ETH_MODULE_ID index)
{
     ETH_MCSRxResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MCSRxResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MCSRxResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFuncResetEnable(ETH_MODULE_ID index)
{
     ETH_RxFuncResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFuncResetDisable(ETH_MODULE_ID index)
{
     ETH_RxFuncResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_RxFuncResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_RxFuncResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MCSTxResetEnable(ETH_MODULE_ID index)
{
     ETH_MCSTxResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MCSTxResetDisable(ETH_MODULE_ID index)
{
     ETH_MCSTxResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MCSTxResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MCSTxResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxFuncResetEnable(ETH_MODULE_ID index)
{
     ETH_TxFuncResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxFuncResetDisable(ETH_MODULE_ID index)
{
     ETH_TxFuncResetDisable_Default(index);
}

